"use client";

import MainLayout from "src/layouts/main";
import HeroImage from "src/components/image/hero-image";
import { Container, Typography, Stack } from "@mui/material";
import ServiceItem from "../home/service-item";
import { caligraphicFont } from "src/theme/typography";
import Image from "src/components/image/image";
import Box from "@mui/material/Box";

export default function IntroductionView(params) {
  return (
    <MainLayout>
      <HeroImage
        imgURL={"/assets/images/home/hero/TUY_0011.avif"}
        description={""}
        title={""}
      />

      <Container sx={{ marginTop: "5px", marginBottom: "2rem" }}>
        <Stack spacing={3}>
          <Typography
            variant="h2"
            textAlign={"center"}
            fontFamily={caligraphicFont.style.fontFamily}
          >
            Танилцуулга
          </Typography>
          <Typography variant="h5" textAlign={"center"} mb={3}>
            Түүхэн замнал
          </Typography>
          <Typography textAlign={"justify"}>
            1974 онд Гэрлэх ёслолын ордоныг барих шийдвэр гарч зураг төсөл
            хийгдэж, барилгын ажил эхэлсэн.
          </Typography>
          <Box>
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/barilgiin-ajil.jfif"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>

          <Typography textAlign={"justify"}>
            1975 оны 12-р сарын 4-ний өдөр ““Гэрлэх ёслолын ордон”-ыг ЗХУ-аас
            БНМАУ-д хүлээлгэн өгсөн.
          </Typography>
          <Box>
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/huleelgen-uguh.jfif"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>

          <Typography textAlign={"justify"}>
            <br />
            1976 оны 1-р сарын 27 -ний өдрийн МАХН-ын төв хорооны улс төриийн
            товчооны 30-р тогтоолоор “Гэрлэх ёслолын ордон”-ыг аж ахуй, зохион
            байгуулалтын хувьд Улаанбаатар хотын АДХ-ын гүйцэтгэх захиргаанд
            харъяалуулсан.
            <br />
            1976 оны 6-р сарын 10 өдрийн БНМАУ-ын Сайд нарын зөвлөлийн 128 тоот
            тогтоолоор иргэний гэр бүлийн хэлтсийг 5 хүний бүрэлдэхүүнтэй
            байгуулж, 1976 оны 6-р сарын 14-ний өдөр албан ёсоор нээв.
          </Typography>

          <Box>
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/neelt.jfif"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>
          <Typography textAlign={"justify"}>
            <br />
            1990 оны 12-р сарын 13-ний өдөр Улаанбаатар хотын АДХ-ын гүйцэтгэх
            захиргааны 295-р тогтоолоор аж ахуйн бүрэн тооцоонд шилжүүлсэн.
            <br />
            1991 оны 12-р сарын 24 -ний өдрийн 360-р тогтоолоор “Гэрлэх ёслолын
            ордон”-ыг улсын үйлдвэрийн газар болгосон.
            <br />
            1992 онд Иргэний бүртгэлийн хэлтсийг Гэрлэх ёслолын ордноос
            тусгаарлав.
            <br />
            2015 оны 01 дүгээр сарын 26-ны өдрийн НИТХТ-ийн 26 дугаар тогтоолоор
            Гэрлэх ёслолын ордоныг Орон нутгийн өмчит аж ахуйн тооцоот
            үйлдвэрийн газар болгож үйл ажиллагааны үндсэн чиглэл, дүрмийг
            батлав.
          </Typography>
          <Box>
            <br />
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/outside.jpg"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>
          <Typography textAlign={"justify"}>
            <Typography variant="h5" textAlign={"center"} my={3}>
              Гэрлэх ёслолын ордны үе үеийн удирдлагаар
            </Typography>
            1975-1986 АДХГЗ-ны харъяа Гэрлэх ёслолын ордны дарга Д.Дашдэндэв
            <br />
            1986-1991 АДХГЗ-ны харъяа Гэрлэх ёслолын ордны дарга Р.Тогоо
            <br />
            1991-2012 Гэрлэх ёслолын ордон НӨҮГ-ын дарга Х.Оюунчимэг
            <br />
            2012-2022 Гэрлэх ёслолын ордон ОНӨААТҮГ-ын захирал С.Үүрийнтуяа
            <br />
            2022 оноос Гэрлэх ёслолын ордон ОНӨААТҮГ-ын захирал М.Уянга ажиллаж
            байна.
          </Typography>
          <Box>
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/entrance.jpg"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>
          <Typography textAlign={"justify"}>
            Гэрлэх ёслолын ордон нь Монгол түмний гал голомтыг бадраан хуримын
            ёслолын үйл ажиллагааг эрхлэх үндсэн зорилготойгоор 1976 оны 06
            сарын 14-ний өдөр үүдээ нээж өнөөг хүртэл үндсэн үйл ажиллагаагаа
            амжилттай явуулсаар байна. <br />
            Ёст төрийн хос баганат манай өргөө нь гэр бүлийн амьдралд тохиолдох
            дахин давтагдашгүй алтан агшинг бүтээж байгаа мэргэшсэн хамт олон
            төдийгүй залуучуудыг гэр бүлийн амьдралд бэлтгэх зорилгоор гэр
            бүлийн сургалт, зөвлөгөө, олон талт арга хэмжээг зохион байгуулан
            ажиллаж байна. <br />
            Залуу хосын хуримын үйл ажиллагааг зохион байгуулахдаа төрийн
            ёслолыг Их танхимд, гал голомт бадраах ёслолыг Бага танхимд болон Их
            өргөө гэрт тус тус зохион байгуулдаг.
            <br /> Бид залуу хосын гэрлэх ёслолын үйл ажиллагааг хийхээс гадна
            тэмдэглэлт ойн хурим болох Есөн эрдэнийн хурим, Очир-Эрдэнийн хурим,
            Дурсамж өдөрлөг, Олон улсын гэр бүлийн өдөр, Олон улсын ахмадын
            өдөр, Нийслэл хот байгуулагдсаны ой, Улс тунхагласны баярын
            өдрүүдээр НЗДТГ-тай хамтран тусгай хөтөлбөрөөр тэмдэглэн өнгөрүүлж
            гэрлэх ёслолыг зохион байгуулдаг уламжлалтай.
          </Typography>

          <Typography textAlign={"justify"}>
            1974 онд Монголын ард түмэн Бүгд Найрамдах Улсаа тунхагласны хагас
            зуун жилийн ойгоо тэмдэглэж байх тэр агшинд Монгол Улсын Төрийн
            тэргүүн Ю.Цэдэнбалын гэргий А.И.Цэдэнбал Филатова ЗХУ-ын төрийн
            тэргүүн Л.И.Брежнев тэргүүтэй зочидод олон үндэстэн ястны өлгий
            болсон Монгол улсад шинэ айл өрхөө татаж, гал голомтоо бадраах бүрт
            төрөл садан, төр түмнээс нь хуримын ёслол үйлдэх ариун хайрын, шинэ
            цагийн өргөө хэрэгцээтэй байгааг хэлэхийн дашрамд, ахан дүүсийн
            холбоогоо бататгах нандин бэлэг барих санал дэвшүүлэв.
            <br />
            Зочид саналыг талархалтай хүлээн авч, ЗХУ-ын буцалтгүй тусламжаар
            Монголд төдийгүй Төв Азидаа анхны “Гэрлэх ёслолын ордон”-ыг
            сүндэрлүүлэн бэлэглэсэн түүхтэй.
            <br />
            Монголын уран барилгын өнгө төрхийг харуулсан энэ ордныг Монгол
            Зөвлөлтийн архитекторчид, урлагийн мастерууд, барилгачин залуучууд
            богино хугацаанд барьж хүлээлгэн өгсөн юм. Тус ордны Ерөнхий
            зураачаар Монгол Улсын Ардын зураач Д.Амгалан, модон сиийлбэрийг
            Л.Чуваамид, А.Сэнгэцохио тэргүүтэй олон уран бүтээлчид гар, ухааны
            урыг хослуулан, билиг авьяасаа дайчлан байж бүтээлцсэн түүхтэй.
          </Typography>
          <Box>
            <Image
              dir="ltr"
              alt={"Greetings"}
              src={"/assets/images/about/gerchilgee.jpg"}
              ratio="21/9"
              maxWidth={"70%"}
              sx={{
                border: 0,
                borderRadius: 1,
                marginLeft: "15%",
              }}
            />
          </Box>
        </Stack>
      </Container>
      {/* <ServiceItem /> */}
    </MainLayout>
  );
}
